# -*- coding: UTF-8 -*-

# Filename :  factorialDemo.py
# author by : www.oneplusone.top

# 整数的阶乘（英语：factorial）是所有小于及等于该数的正整数的积，0的阶乘为1。即：n!=1×2×3×...×n。

# 通过用户输入数字计算阶乘

# 获取用户输入的数字
num = int(input("请输入一个数字: "))
factorial = 1
SumSum = 0

# 查看数字是负数，0 或 正数
if num < 0:
   print("抱歉，负数没有阶乘")
elif num == 0:
   print("0 的阶乘为 1")
else:
   for i in range(1,num + 1):
       factorial = factorial*i
       SumSum=SumSum+factorial
   print("%d 的阶乘为 %d" %(num,factorial))
   print("1至%d 的阶乘和为 %d" % (num, SumSum))

   # 请输入一个数字: 100
   # 100的阶乘为 93326215443944152681699238856266700490715968264381621468592963895217599993229915608941463976156518286253697920827223758251185210916864000000000000000000000000
   # 1至100的阶乘和为 94269001683709979260859834124473539872070722613982672442938359305624678223479506023400294093599136466986609124347432647622826870038220556442336528920420940313